(fix) removed text diagrams and added mermaid diagrams
text diagrams were distorting in mobile view
